var navHeaderTop = new Vue({
  el: "#popular",
  data: {
    supplements: [
      { name: "Предметы для ухода", id: "1" },
      { name: "Средства для дезинфекции", id: "2" },
      { name: "Ароматерапия", id: "3" },
      { name: "Бумажно-ватная продукция", id: "4" },
      { name: "Гигиена", id: "5" },
      { name: "Дезодоранты", id: "6" },
      { name: "Женская гигиена", id: "7" },
      { name: "Репелленты", id: "8" },
      { name: "Солнцезащитные средства", id: "9" },
    ],
    cosmetics: [
      { name: "Предметы для ухода", id: "1" },
      { name: "Средства для дезинфекции", id: "2" },
      { name: "Ароматерапия", id: "3" },
      { name: "Бумажно-ватная продукция", id: "4" },
      { name: "Гигиена", id: "5" },
      { name: "Дезодоранты", id: "6" },
      { name: "Женская гигиена", id: "7" },
      { name: "Репелленты", id: "8" },
      { name: "Солнцезащитные средства", id: "9" },
    ],
    hygiene: [
      { name: "Предметы для ухода", id: "1" },
      { name: "Средства для дезинфекции", id: "2" },
      { name: "Ароматерапия", id: "3" },
      { name: "Бумажно-ватная продукция", id: "4" },
      { name: "Гигиена", id: "5" },
      { name: "Дезодоранты", id: "6" },
      { name: "Женская гигиена", id: "7" },
      { name: "Репелленты", id: "8" },
      { name: "Солнцезащитные средства", id: "9" },
    ],
    diagnostics: [
      { name: "Предметы для ухода", id: "1" },
      { name: "Средства для дезинфекции", id: "2" },
      { name: "Ароматерапия", id: "3" },
      { name: "Бумажно-ватная продукция", id: "4" },
      { name: "Гигиена", id: "5" },
      { name: "Дезодоранты", id: "6" },
      { name: "Женская гигиена", id: "7" },
      { name: "Репелленты", id: "8" },
      { name: "Солнцезащитные средства", id: "9" },
    ],
  },
});

var actions = new Vue({
  el: "#action",
  data: { actions: [
    {
      name: "Вкусный микс",
      data: "с 1 октября по 30 ноября 2021 года",
      img: '../img/action_1.jpg',
    },
    {
      name: "Окувайт Макс и Визлея",
      data: "с 1 октября по 30 ноября 2021 года",
      img: "/img/action_2.png",
    },
    {
      name: "Скидка 40% на LightWeight",
      data: "с 1 октября по 30 ноября 2021 года",
      img: "/img/action_3.jpg",
    },
    {
      name: "Скидка 20% на зубную пасту Zero White",
      data: "с 1 октября по 30 ноября 2021 года",
      img: "/img/action_4.jpg",
    }, 
  ],
}
});

var cards = new Vue({
  el: "#recommendations",
  data: { cards: [
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
  ],
}
});

var shelves = new Vue({
  el: "#shelves",
  data: { cards: [
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
    {
      name: "Аквалор Беби, капли назальные с рождения, 15мл",
      provider: "Производитель: ИС ЛАБ",
      country:"Страна производства: ФРАНЦИЯ",
      img: '../img/card.jpg',
      price: "2 262 руб."
    },
  ],
}
});


var navFooter = new Vue({
  el: "#nav-footer",
  data: {
    farmani: [
      { name: "О компании ", id: "1" },
      { name: "Контакты", id: "2" },
      { name: "Вакансии", id: "3" },
      { name: "Новости", id: "4" },
      { name: "Список аптек", id: "5" },
      { name: "Арендодателям", id: "6" },
      { name: "Производителям", id: "7" },
      { name: "Мобильное приложение", id: "8" },
    ],
    products: [
      { name: "Каталог товаров", id: "1" },
      { name: "Товары от А до Я", id: "2" },
      { name: "Производители от А до Я", id: "3" },
      { name: "Товары по симптомам от А до Я", id: "4" },
      { name: "Действующие вещества от А до Я", id: "5" },
    ],
    documents: [
      { name: "Пользовательское соглашение", id: "1" },
      { name: "Правила оказания услуг", id: "2" },
      { name: "Правила бонусной программы", id: "3" },
      { name: "Дистанционная торговля", id: "4" },
      { name: "Условия продажи дистанционным способом", id: "5" },
      { name: "Лицензии", id: "6" },
      { name: "Госреестр цен", id: "7" },
    ],
    customer: [
      { name: "Оформление заказа", id: "1" },
      { name: "Оплата заказа", id: "2" },
      { name: "Доставка", id: "3" },
      { name: "Вопрос-ответ", id: "4" },
      { name: "Возврат и обмен", id: "5" },
    ],
  },
});